Revit 2027 API
RebarShapeSegment.SetConstraints Method
 Assign a new list of constraints to this segment.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetConstraints(
	IList<RebarShapeConstraint> constraints
)
Public Sub SetConstraints (
	constraints As IList(Of RebarShapeConstraint)
)
public:
void SetConstraints(
	IList<RebarShapeConstraint^>^ constraints
)
member SetConstraints :
        constraints : IList<RebarShapeConstraint> -> unit
Parameters
constraints IList<RebarShapeConstraint>
 A new list of constraints.
Exceptions
Exception | Condition
ArgumentException |  One or more of the constraints is of a type not supported for RebarShapeSegment.
ArgumentNullException |  A non-optional argument was null
Remarks
 Any existing constraints are discarded. The new constraints replace them. Any parameters driving the constraints must already be added with RebarShapeDefinition.AddParameter().
 The allowable constraint types are:
RebarShapeConstraintAngleFromFixedDir
RebarShapeConstraintSegmentLength
RebarShapeConstraintFixedSegmentDir
RebarShapeConstraintProjectedSegmentLength
RebarShapeConstraint180DegreeBendArcLength
RebarShapeConstraint180DegreeBendRadius
RebarShapeConstraint180DegreeDefaultBend
 At least two independent constraints must be specified. Overconstraining is supported. Constraints of type RebarShapeConstraintFixedSegmentDir must be unique.
See Also
Reference
RebarShapeSegment Class
Autodesk.Revit.DB.Structure Namespace